public_html/Software Engineering/git/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>git command</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="git command"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-05T10:13+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">git command</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 git branch and merge</a></li>
<li><a href="#sec-2">2 merge conflict resolution</a></li>
<li><a href="#sec-3">3 tag</a></li>
<li><a href="#sec-4">4 替换本地改动</a></li>
<li><a href="#sec-5">5 Creating Project Pages manually</a></li>
<li><a href="#sec-6">6 Setting up a custom domain with Pages</a>
<ul>
<li><a href="#sec-6-1">6.1 Top-level domain (TLD)</a></li>
<li><a href="#sec-6-2">6.2 Subdomains</a></li>
</ul>
</li>
<li><a href="#sec-7">7 public and private.</a>
<ul>
<li><a href="#sec-7-1">7.1 Short lived work</a></li>
<li><a href="#sec-7-2">7.2 Larger work</a></li>
<li><a href="#sec-7-3">7.3 Declaring Branch Bankruptcy</a></li>
<li><a href="#sec-7-4">7.4 The intended workflow is:</a></li>
</ul>
</li>
<li><a href="#sec-8">8 staging</a></li>
<li><a href="#sec-9">9 other</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> git branch and merge</h2>
<div class="outline-text-2" id="text-1">




<pre class="src src-sh">git branch branchname
git checkout branchname
git push origin branchname
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">do something</span>
git merge master
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">merge into master</span>
git checkout master
git merge branchname
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">delete the branch</span>
git branch -d branchname
</pre>

<ul>
<li><a href="http://gitref.org/branching/">http://gitref.org/branching/</a>
</li>
<li><a href="http://learn.github.com/p/branching.html">http://learn.github.com/p/branching.html</a>
</li>
<li><a href="http://git-scm.com/book/en/Git-Branching-Basic-Branching-and-Merging">http://git-scm.com/book/en/Git-Branching-Basic-Branching-and-Merging</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> merge conflict resolution</h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-sh">$ git merge experiment
Auto-merging lib/simplegit.rb
<span style="color: #87cefa;">CONFLICT</span> (content): Merge conflict<span style="color: #00ffff;"> in</span> lib/simplegit.rb
Automatic merge failed; fix conflicts and then commit the result.

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">When you&#8217;re done fixing it, all you have to do is run &#8216;git add&#8217; on the file to re-stage it, which marks it as resolved. Then commit the merge.</span>
$ git add lib/simplegit.rb
$ git commit
[master]: created 6d52a27: <span style="color: #ffa07a;">"Merge branch 'experiment'"</span>
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> tag</h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-sh">git tag 1.0.0 1b2e1d63ff

&#20351;&#29992;&#22914;&#19979;&#21629;&#20196;&#33719;&#21462;&#25552;&#20132; ID&#65306;
git log
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 替换本地改动</h2>
<div class="outline-text-2" id="text-4">





<pre class="src src-sh">&#20351;&#29992;&#22914;&#19979;&#21629;&#20196;&#26367;&#25442;&#25481;&#26412;&#22320;&#25913;&#21160;&#65306;
git checkout -- &lt;filename&gt;
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#27492;&#21629;&#20196;&#20250;&#20351;&#29992; HEAD &#20013;&#30340;&#26368;&#26032;&#20869;&#23481;&#26367;&#25442;&#25481;&#20320;&#30340;&#24037;&#20316;&#30446;&#24405;&#20013;&#30340;&#25991;&#20214;&#12290;&#24050;&#28155;&#21152;&#21040;&#32531;</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#23384;&#21306;&#30340;&#25913;&#21160;&#65292;&#20197;&#21450;&#26032;&#25991;&#20214;&#65292;&#37117;&#19981;&#21463;&#24433;&#21709;&#12290;</span>


<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#20551;&#22914;&#20320;&#24819;&#35201;&#20002;&#24323;&#20320;&#25152;&#26377;&#30340;&#26412;&#22320;&#25913;&#21160;&#19982;&#25552;&#20132;&#65292;&#21487;&#20197;&#21040;&#26381;&#21153;&#22120;&#19978;&#33719;&#21462;&#26368;&#26032;&#30340;&#29256;&#26412;&#24182;&#23558;&#20320;&#26412;&#22320;&#20027;&#20998;&#25903;&#25351;&#21521;&#21040;&#23427;&#65306;</span>

git fetch origin
git reset --hard origin/master
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Creating Project Pages manually</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-sh">$ git checkout --orphan gh-pages
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Creates our branch, without any parents (it's an orphan!)</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Switched to a new branch 'gh-pages'</span>

git rm -rf .
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Remove all files from the old working tree</span>

$ echo <span style="color: #ffa07a;">"My GitHub Page"</span> &gt; index.html
$ git add .
$ git commit -a -m <span style="color: #ffa07a;">"First pages commit"</span>
$ git push origin gh-pages

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">To unpublish a project page, delete the remote gh-pages branch:</span>
git push origin --delete gh-pages
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Setting up a custom domain with Pages</h2>
<div class="outline-text-2" id="text-6">




<pre class="src src-sh"><span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">'example.com'</span> &gt;&gt;  CNAME
</pre>


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Top-level domain (TLD)</h3>
<div class="outline-text-3" id="text-6-1">

<p>For a TLD like example.com, you should use an A record pointing to
204.232.175.78:<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>
</p>
<p>
在Linux终端下检查：
</p>


<pre class="src src-sh">dig example.com +nostats +nocomments +nocmd
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Look up DNS record for example.com</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">;example.com.                    IN      A</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">example.com.             3259    IN      A       204.232.175.78</span>
</pre>

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Subdomains</h3>
<div class="outline-text-3" id="text-6-2">

<p>When working with a subdomain it is best to set a CNAME record
pointing to your user pages subdomain. 
</p>
<p>
在Linux终端下检查：
</p>


<pre class="src src-sh"> dig www.example.com +nostats +nocomments +nocmd
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">;www.example.com.                 IN      A</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">www.example.com.          3592    IN      CNAME   username.github.com.</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">username.github.com.      43192   IN      A       204.232.175.78</span>
</pre>


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> public and private.</h2>
<div class="outline-text-2" id="text-7">

<p>Consider how a common Git workflow falls apart.
</p>
<p>
<i>Create a branch off Master, do work, and merge it back into Master when you’re done</i>
</p>
<p>
Most of the time this behaves as you expect because Master changed
since you branched. Then one day you merge a feature branch into
Master, but Master hasn’t diverged. Instead of creating a merge
commit, Git points Master to the latest commit on the feature branch,
or “fast forwards.”<a href="http://sandofsky.com/images/fast_forward.pdf">Picture</a> <sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup>
</p>
<p>
So you add a new rule: “When you merge in your feature branch, use
<code>–no-ff</code> to force a new commit.” 
</p>
</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Short lived work</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="src src-sh">git checkout -b private_feature_branch
touch file1.txt
git add file1.txt
git commit -am <span style="color: #ffa07a;">"WIP"</span>
</pre>

<p>
When I’m done, instead of a vanilla git merge, I’ll run:
</p>


<pre class="src src-sh">git checkout master
git merge --squash private_feature_branch
git commit -v
</pre>

<p>
Then I spend a minute writing a detailed commit message.
</p>
</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Larger work</h3>
<div class="outline-text-3" id="text-7-2">

<p>If my checkpoint commits followed a logical progression, I can use
rebase’s Interactive Mode.
</p>
<p>
Interactive mode is powerful. You can use it to edit an old commits,
split them up, reorder them, and in this case squash a few.
</p>
<p>
On my feature branch:
</p>


<pre class="src src-sh">git rebase --interactive master
</pre>

<p>
By default, each commit uses “pick,” which doesn’t modify the commit.
</p>


<pre class="src src-sh">pick ccd6e62 Work on back button
pick 1c83feb Bug fixes
pick f9d0c33 Start work on toolbar
</pre>

<p>
I change the operation to “squash,” which squashes the second commit
into the first.
</p>


<pre class="src src-sh">pick ccd6e62 Work on back button
squash 1c83feb Bug fixes
pick f9d0c33 Start work on toolbar
</pre>

<p>
When I save and close, a new editor prompts me for the commit message
    of the combined commit, and then I’m done.
</p></div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Declaring Branch Bankruptcy</h3>
<div class="outline-text-3" id="text-7-3">

<p>It’s easiest to grab the raw diff create a clean branch.
</p>


<pre class="src src-sh">git checkout master
git checkout -b cleaned_up_branch
git merge --squash private_feature_branch
git reset
</pre>

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> The intended workflow is:</h3>
<div class="outline-text-3" id="text-7-4">

<ol>
<li>Create a private branch off a public branch.
</li>
<li>Regularly commit your work to this private branch.
</li>
<li>Once your code is perfect, clean up its history.
</li>
<li>Merge the cleaned-up branch back into the public branch.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> staging</h2>
<div class="outline-text-2" id="text-8">

<p><a href="http://www.benspaulding.us/weblog/2009/mar/17/git-staging-call-it-what-it-is/">http://www.benspaulding.us/weblog/2009/mar/17/git-staging-call-it-what-it-is/</a>
</p>
<p>
<a href="http://git-scm.com/book/en/Git-Basics-Recording-Changes-to-the-Repository">http://git-scm.com/book/en/Git-Basics-Recording-Changes-to-the-Repository</a>
</p>
<p>
<a href="http://git-scm.com/book/en/Git-Tools-Interactive-Staging">http://git-scm.com/book/en/Git-Tools-Interactive-Staging</a>
</p>
<p>
<a href="http://www.cnblogs.com/chiao/archive/2011/07/27/2117835.html">http://www.cnblogs.com/chiao/archive/2011/07/27/2117835.html</a>
</p>

<p>
<a href="http://git-scm.com/book/ch2-4.html">http://git-scm.com/book/ch2-4.html</a>
</p>
<p>
<a href="http://learn.github.com/p/undoing.html">http://learn.github.com/p/undoing.html</a>
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> other</h2>
<div class="outline-text-2" id="text-9">

<p>内建的图形化 git：
gitk
彩色的 git 输出：
git config color.ui true
显示历史记录时，只显示一行注释信息：
git config format.pretty oneline
交互地添加文件至缓存区：
git add -i
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="https://help.github.com/articles/setting-up-a-custom-domain-with-pages">Setting up a custom domain with Pages</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> <a href="http://sandofsky.com/blog/git-workflow.html">Understanding the Git Workflow</a>
</p>


</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-05T10:13+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
